app/Http/Controllers/BlogController.php

    public function index(): View
    {
        $post = Post::find(4);
        $post->category_id = 2;
        $post->save();
        $category = $post->category->name;
        return view('blog.index', [
            'posts' => Post::paginate(2)
        ]);
---
select * from "posts" limit 2 offset 0