app/Http/Controllers/BlogController.php

    public function index(): View
    {
        return view('blog.index', [
            'posts' => Post::with('tags', 'category')->paginate(6)
        ]);
---
select * from "post_tag" where "post_tag"."post_id" = 15
select "tags".*, "post_tag"."post_id" as "pivot_post_id", "post_tag"."tag_id" as "pivot_tag_id" from "tags" inner join "post_tag" on "tags"."id" = "post_tag"."tag_id" where "post_tag"."post_id" in (2, 4, 5, 6, 7, 8)
select * from "categories" where "categories"."id" in (1, 2)
select * from "posts" limit 6 offset 12

    public function create()
    {
        $post = new Post();
        $post->title = 'Bonjour';
        return view('blog.create', [
            'post' => $post,
            'categories' => Category::select('id', 'name')->get(),
            'tags' => Tag::select('id', 'name')->get()
        ]);
---
select "id", "name" from "categories"
select "id", "name" from "tags"

    public function store(FormPostRequest $request)
    {
        $post = Post::create($this->extractData(new Post(), $request));
---
insert into "posts" ("title", "slug", "content", "category_id", "image", "updated_at", "created_at") values ('Pikachu pokemon', 'pikachu-pokemon', 'test', '1', 'blog/EGHAVOxcnzBcOtCHUqgbDH8QRCM1NEj00dtaYDIZ.png', '2023-08-06 21:33:56', '2023-08-06 21:33:56')

    public function edit(Post $post)
    {
        return view('blog.edit', [
            'post' => $post,
            'categories' => Category::select('id', 'name')->get(),
            'tags' => Tag::select('id', 'name')->get()
        ]);
---
select "id", "name" from "categories"
select "id", "name" from "tags"

    public function update(Post $post, FormPostRequest $request)
    {
        $post->update($this->extractData($post, $request));
---
update "posts" set "image" = 'blog/SkGenT0ZpJVsMe4QaH0RvC6EjadLL9IoU1W4X18n.png', "updated_at" = '2023-08-06 21:33:31' where "id" = 2