app/Http/Controllers/Admin/PropertyController.php

select * from "properties" order by "created_at" desc limit 25 offset 0
select count(*) as aggregate from "properties"
---
    public function index()
    {
        return view('admin.properties.index', [
            'properties' => Property::orderBy('created_at', 'DESC')->paginate(25)
        ]);

insert into "properties" ("title", "description", "surface", "rooms", "bedrooms", "floor", "price", "city", "address", "postal_code", "sold", "updated_at", "created_at") values ('Mon troisième bien', 'Ma description', '40', '3', '1', '0', '150000', 'Angoulême', '2 rue du Bouzeux', '16000', '0', '2023-08-12 13:43:27', '2023-08-12 13:43:27')
---
    public function store(PropertyFormRequest $request)
    {
        $property = Property::create($request->validated());

update "properties" set "surface" = '80', "updated_at" = '2023-08-12 13:55:28' where "id" = 3
---
    public function update(PropertyFormRequest $request, Property $property)
    {
        $property->update($request->validated());

delete from "properties" where "id" = 3
---
    public function destroy(Property $property)
    {
        $property->delete();